app/controllers/v1/civitas_akademika_controller.rb

def updateRekeningMahasiswa
    mahasiswa = Mahasiswa.find_by(nim: params[:nim])

    unless mahasiswa
      render json: { error: "Mahasiswa dengan NIM #{params[:nim]} tidak ditemukan" }, status: :not_found
      return
    end

    rekening_bank = RekeningBank.find_by(mahasiswa_id: mahasiswa.id)

    unless rekening_bank
      render json: { error: "Rekening bank mahasiswa belum terdaftar" }, status: :not_found
      return
    end

    # ✅ Tambahkan pengecekan parameter
    required_params = %i[nama_bank nomor_rekening nama_pemilik_rekening]
    missing_params = required_params.select { |key| params[key].blank? }

    unless missing_params.empty?
      render json: { error: "Parameter tidak lengkap: #{missing_params.join(', ')}" }, status: :unprocessable_entity
      return
    end

    if rekening_bank.update(
      nama_bank: params[:nama_bank],
      nomor_rekening: params[:nomor_rekening],
      nama_pemilik_rekening: params[:nama_pemilik_rekening]
    )
---
SELECT `mahasiswa`.* FROM `mahasiswa` WHERE `mahasiswa`.`nim` = '231511038' LIMIT 1
SELECT `rekeningbank`.* FROM `rekeningbank` WHERE `rekeningbank`.`mahasiswa_id` = '231511038' LIMIT 1
UPDATE `rekeningbank` SET `rekeningbank`.`nomor_rekening` = '15932321321', `rekeningbank`.`nama_pemilik_rekening` = 'Ujang' WHERE `rekeningbank`.`nomor_rekening` = '1234567890123456'