app/controllers/v1/rekapitulasi_controller.rb

SELECT `bantuandanabeasiswa`.* FROM `bantuandanabeasiswa` WHERE (status_pengajuan = 1 or status_pengajuan = 3 ) AND `bantuandanabeasiswa`.`penggalangan_dana_beasiswa_id` = 1
---
  def getRekapitulasiBeasiswa
    if params[:id].blank?
      return render_error_response("Id tidak boleh kosong!")
    end
    if params[:month].blank?
      return render_error_response("Month tidak boleh kosong!")
    end

    penggalangan_dana_beasiswa = PenggalanganDanaBeasiswa.where(penggalangan_dana_beasiswa_id: params[:id]).first
    if penggalangan_dana_beasiswa.nil?
      return render_error_response("Batch Rekapitulasi Beasiswa tidak dapat ditemukan!")
    end

    bantuan_dana_beasiswa = BantuanDanaBeasiswa.rekapitulasi.where(penggalangan_dana_beasiswa_id: params[:id])

SELECT `penggalangandanabeasiswa`.* FROM `penggalangandanabeasiswa`
---
    end

    rekapitulasi_donasi = getApprovedDonasiByPenggalanganDana(penggalangan_dana_beasiswa.penggalangan_dana_beasiswa_id, return_json: false)
    selected_rekapitulasi_donasi = rekapitulasi_donasi.select do |item|

SELECT `penggalangandanabeasiswa`.* FROM `penggalangandanabeasiswa` WHERE `penggalangandanabeasiswa`.`penggalangan_dana_beasiswa_id` = 1 ORDER BY `penggalangandanabeasiswa`.`penggalangan_dana_beasiswa_id` ASC LIMIT 1
---
  def getSaldoAwal(penggalangan_dana_beasiswa_id)
    penggalangan_dana_beasiswa = PenggalanganDanaBeasiswa.where(penggalangan_dana_beasiswa_id: penggalangan_dana_beasiswa_id).first

SELECT `penggalangandanabeasiswa`.* FROM `penggalangandanabeasiswa` WHERE `penggalangandanabeasiswa`.`penggalangan_dana_beasiswa_id` = 1 ORDER BY `penggalangandanabeasiswa`.`penggalangan_dana_beasiswa_id` ASC LIMIT 1
---
  def getBulanRekapitulasiBeasiswa(penggalangan_dana_id = nil, return_json: true)
    if penggalangan_dana_id == nil
      penggalangan_dana_id = params[:id]
    end
    penggalangan_dana_beasiswa = PenggalanganDanaBeasiswa.where(penggalangan_dana_beasiswa_id: penggalangan_dana_id).first