app/controllers/v1/rekapitulasi_controller.rb

SELECT `penggalangandanabeasiswa`.* FROM `penggalangandanabeasiswa` WHERE `penggalangandanabeasiswa`.`penggalangan_dana_beasiswa_id` = 1 ORDER BY `penggalangandanabeasiswa`.`penggalangan_dana_beasiswa_id` ASC LIMIT 1
SELECT `bantuandanabeasiswa`.* FROM `bantuandanabeasiswa` WHERE (status_pengajuan = 1 or status_pengajuan = 3 ) AND `bantuandanabeasiswa`.`penggalangan_dana_beasiswa_id` = 1
SELECT `mahasiswa`.* FROM `mahasiswa` WHERE `mahasiswa`.`nim` = '231511038' ORDER BY `mahasiswa`.`nim` ASC LIMIT 1
SELECT `mahasiswa`.* FROM `mahasiswa` WHERE `mahasiswa`.`nim` = 'MHS001' LIMIT 1
---
  def getRekapitulasiBeasiswa
    if params[:id].blank?
      return render_error_response("Id tidak boleh kosong!")
    end
    if params[:month].blank?
      return render_error_response("Month tidak boleh kosong!")
    end
    penggalangan_dana_beasiswa = PenggalanganDanaBeasiswa.where(penggalangan_dana_beasiswa_id: params[:id]).first
    if !penggalangan_dana_beasiswa.present?
      return render_error_response("Batch Rekapitulasi Beasiswa tidak dapat ditemukan!")
    end
    bantuan_dana_beasiswa = BantuanDanaBeasiswa.rekapitulasi.where(penggalangan_dana_beasiswa_id: params[:id])
    puts bantuan_dana_beasiswa.inspect
    array_of_penerima_beasiswa = []
    bantuan_dana_beasiswa.each do |data|
    mahasiswa = Mahasiswa.where(nim: data.mahasiswa_id).first
    rekening = data.mahasiswa&.rekening_bank&.first

SELECT `penggalangandanabeasiswa`.* FROM `penggalangandanabeasiswa` ORDER BY `penggalangandanabeasiswa`.`penggalangan_dana_beasiswa_id` ASC LIMIT 1
---
    # end

    rekapitulasi_donasi = getApprovedDonasiByPenggalanganDana(penggalangan_dana_beasiswa.penggalangan_dana_beasiswa_id, return_json:false)
    selected_rekapitulasi_donasi = rekapitulasi_donasi.select do |item|

SELECT `penggalangandanabeasiswa`.* FROM `penggalangandanabeasiswa`
---
  def getAllBatchRekapitulasiBeasiswa
    batch_beasiswa = PenggalanganDanaBeasiswa.all
    if !batch_beasiswa.present?

SELECT `bantuandananonbeasiswa`.* FROM `bantuandananonbeasiswa` WHERE (status_pengajuan = 3 or status_penyaluran = 0 or status_penyaluran = 1)
SELECT `penanggungjawabnonbeasiswa`.* FROM `penanggungjawabnonbeasiswa` WHERE `penanggungjawabnonbeasiswa`.`nomor_induk` = '231511042' ORDER BY `penanggungjawabnonbeasiswa`.`nomor_induk` ASC LIMIT 1
SELECT `penanggungjawabnonbeasiswa_has_penerimanonbeasiswa`.* FROM `penanggungjawabnonbeasiswa_has_penerimanonbeasiswa` WHERE `penanggungjawabnonbeasiswa_has_penerimanonbeasiswa`.`penanggung_jawab_non_beasiswa_id` = '231511042' ORDER BY `penanggungjawabnonbeasiswa_has_penerimanonbeasiswa`.`penanggung_jawab_non_beasiswa_id` ASC, `penanggungjawabnonbeasiswa_has_penerimanonbeasiswa`.`penerima_non_beasiswa_id` ASC LIMIT 1
SELECT `penerimanonbeasiswa`.* FROM `penerimanonbeasiswa` WHERE `penerimanonbeasiswa`.`nomor_induk` = '231511038' ORDER BY `penerimanonbeasiswa`.`nomor_induk` ASC LIMIT 1
---
  def getRekapitulasiNonBeasiswa
    bantuan_dana_non_beasiswa = BantuanDanaNonBeasiswa.rekapitulasi
    if !bantuan_dana_non_beasiswa.present?
      return render_error_response("Tidak ada data Rekapitulasi Dana Non Beasiswa!")
    end
    array_rekapitulasi_non_beasiswa = []
    bantuan_dana_non_beasiswa.each do |data|
      penanggung_jawab_non_beasiswa = PenanggungJawabNonBeasiswa.where(nomor_induk: data.penanggung_jawab_non_beasiswa_id).first
      penanggung_jawab_penerima = PenanggungJawabNonBeasiswaHasPenerimaNonBeasiswa.where(penanggung_jawab_non_beasiswa_id: penanggung_jawab_non_beasiswa.nomor_induk).first
      penerima_non_beasiswa = PenerimaNonBeasiswa.where(nomor_induk: penanggung_jawab_penerima.penerima_non_beasiswa_id).first

SELECT `bantuandanabeasiswa`.* FROM `bantuandanabeasiswa` WHERE (status_pengajuan = 1 or status_pengajuan = 3 ) AND `bantuandanabeasiswa`.`bantuan_dana_beasiswa_id` = 1 ORDER BY `bantuandanabeasiswa`.`bantuan_dana_beasiswa_id` ASC LIMIT 1
---
  def selectPenyaluranBeasiswa
    if params[:id].blank?
      return render_error_response("Id tidak boleh kosong!")
    end
    bantuan_dana_beasiswa = BantuanDanaBeasiswa.rekapitulasi.where(bantuan_dana_beasiswa_id: params[:id]).first

UPDATE `bantuandanabeasiswa` SET `bantuandanabeasiswa`.`nominal_penyaluran` = '[40000,0,0]', `bantuandanabeasiswa`.`status_penyaluran` = '[1,0,0]' WHERE `bantuandanabeasiswa`.`bantuan_dana_beasiswa_id` = 1
---
      bantuan_dana_beasiswa.nominal_penyaluran[params[:bulan_penyaluran] - 1] = params[:nominal_penyaluran]
      bantuan_dana_beasiswa.status_penyaluran[params[:bulan_penyaluran] - 1] = Enums::StatusPenyaluran::DELIVERED
    end
    bantuan_dana_beasiswa.save

SELECT `penggalangandanabeasiswa`.* FROM `penggalangandanabeasiswa` WHERE `penggalangandanabeasiswa`.`penggalangan_dana_beasiswa_id` = 1 LIMIT 1
---
  def getSaldoAwal(penggalangan_dana_beasiswa_id)
    penggalangan_dana_beasiswa = PenggalanganDanaBeasiswa.where(penggalangan_dana_beasiswa_id: penggalangan_dana_beasiswa_id).first
    penggalangan_dana_beasiswa_existing = PenggalanganDanaBeasiswa.done.where("penggalangan_dana_beasiswa_id > ?", penggalangan_dana_beasiswa.penggalangan_dana_beasiswa_id).order("penggalangan_dana_beasiswa_id DESC").first
    if !penggalangan_dana_beasiswa_existing.present?

SELECT `penggalangandanabeasiswa`.* FROM `penggalangandanabeasiswa` WHERE `penggalangandanabeasiswa`.`penggalangan_dana_beasiswa_id` = 1 ORDER BY `penggalangandanabeasiswa`.`penggalangan_dana_beasiswa_id` ASC LIMIT 1
---
  def getBulanRekapitulasiBeasiswa(penggalangan_dana_id = nil, return_json: true)
    if penggalangan_dana_id == nil
      penggalangan_dana_id = params[:id]
    end
    penggalangan_dana_beasiswa = PenggalanganDanaBeasiswa.where(penggalangan_dana_beasiswa_id: penggalangan_dana_id).first
    if !penggalangan_dana_beasiswa.present?

SELECT `bantuandananonbeasiswa`.* FROM `bantuandananonbeasiswa` WHERE `bantuandananonbeasiswa`.`bantuan_dana_non_beasiswa_id` = 1 ORDER BY `bantuandananonbeasiswa`.`bantuan_dana_non_beasiswa_id` ASC LIMIT 1
SELECT `penggalangandanabeasiswa`.* FROM `penggalangandanabeasiswa` WHERE `penggalangandanabeasiswa`.`penggalangan_dana_beasiswa_id` IS NULL ORDER BY `penggalangandanabeasiswa`.`penggalangan_dana_beasiswa_id` ASC LIMIT 1
---
  def getApprovedDonasiByPenggalanganDana(penggalangan_dana_id = nil, return_json: true)
    if penggalangan_dana_id == nil
      if params[:id].blank?
        return render_error_response("Id tidak boleh kosong!")
      end
    end


    bantuan_dana_non_beasiswa = BantuanDanaNonBeasiswa.where(bantuan_dana_non_beasiswa_id: params[:id]).first
    penggalangan_dana_beasiswa = PenggalanganDanaBeasiswa.where(penggalangan_dana_beasiswa_id: penggalangan_dana_id).first