app/controllers/v1/penggalangan/donasi_controller.rb

SELECT `donasi`.* FROM `donasi` WHERE `donasi`.`status` = 0
---
  def getDonasiByStatus
    status = params[:status].to_i

    if status.zero? || status == 4
      status_donasi = status.zero? ? "Baru" : "Expired"
      donasi = Donasi.where(status: status)
      if status.zero? and donasi.present?

SELECT `bantuandanabeasiswa`.* FROM `bantuandanabeasiswa` WHERE `bantuandanabeasiswa`.`status_pengajuan` != 0 AND `bantuandanabeasiswa`.`penggalangan_dana_beasiswa_id` = 1 ORDER BY `bantuandanabeasiswa`.`bantuan_dana_beasiswa_id` ASC LIMIT 1
SELECT `bantuandanabeasiswa`.* FROM `bantuandanabeasiswa` WHERE `bantuandanabeasiswa`.`status_pengajuan` = 1
---
  def getTotalAllDonasi
    donasi = Donasi.approved
    array_of_nominal_donasi = []
    array_of_nominal_penyaluran = []
    donasi.each do |data|
      if data.penggalangan_dana_beasiswa_id != nil
        bantuan_dana_beasiswa = BantuanDanaBeasiswa.where.not(status_pengajuan: Enums::StatusPengajuan::NEW).where(penggalangan_dana_beasiswa_id: data.penggalangan_dana_beasiswa_id).first
        if bantuan_dana_beasiswa.present?