app/controllers/v1/penggalangan/donasi_controller.rb

  def getDonasiByStatus
    status = params[:status].to_i

    if status.zero? || status == 4
      status_donasi = status.zero? ? "Baru" : "Expired"
      donasi = Donasi.where(status: status)
      if status.zero? and donasi.present?
        array_of_donasi = []
        donasi.each do |data|
          if data.struk_pembayaran.present?
            donatur = Donatur.where(nomor_telepon: data.donatur_id).first
            rekening_bank = RekeningBank.where(donatur_id: donatur.nomor_telepon).first
            array_of_donasi << data.attributes.merge({
              judul_galang_dana: PenggalanganDanaBeasiswa.on_going.where(penggalangan_dana_beasiswa_id: data.penggalangan_dana_beasiswa_id).present? ? PenggalanganDanaBeasiswa.on_going.where(penggalangan_dana_beasiswa_id: data.penggalangan_dana_beasiswa_id).first.judul : BantuanDanaNonBeasiswa.where(bantuan_dana_non_beasiswa_id: data.bantuan_dana_non_beasiswa_id).first.judul_galang_dana,
              donatur: donatur,
              rekening_bank: rekening_bank
            })
          end
        end
        array_of_donasi = array_of_donasi.length > 1 ? array_of_donasi.reverse : array_of_donasi
      elsif status == 4 and donasi.present?
        donasi.each do |data|
---
SELECT `donasi`.* FROM `donasi` WHERE `donasi`.`status` = 0