app/controllers/v1/penggalangan/penggalangan_dana_controller.rb

  def getPenggalanganDanaBeasiswa
    penggalangan_dana_beasiswa = PenggalanganDanaBeasiswa.on_going
    data_penggalangan_dana_beasiswa = []
    if !penggalangan_dana_beasiswa.present?
      data_penggalangan_dana_beasiswa = []
    else
      penggalangan_dana_beasiswa.each do |data|
---
SELECT `penggalangandanabeasiswa`.* FROM `penggalangandanabeasiswa`

  def getDurasiPenggalanganDana(penggalangan_dana_id, jenis)
    if jenis == "beasiswa"
      penggalangan_dana_beasiswa = penggalangan_dana_id
      end_date = penggalangan_dana_id.waktu_berakhir
    else
      penggalangan_dana_non_beasiswa = BantuanDanaNonBeasiswa.where(bantuan_dana_non_beasiswa_id: penggalangan_dana_id).first
      end_date = penggalangan_dana_non_beasiswa.waktu_galang_dana
    end
    durasi = (end_date - DateTime.now).to_i + 1
    if durasi < 1
      if jenis == "beasiswa"
        penggalangan_dana_beasiswa.update(status: Enums::StatusPenggalanganDanaBeasiswa::DONE)
        bantuan_dana_beasiswa = BantuanDanaBeasiswa.approved.where(penggalangan_dana_beasiswa_id: penggalangan_dana_beasiswa.penggalangan_dana_beasiswa_id)
        if bantuan_dana_beasiswa.present?
          bantuan_dana_beasiswa.each do |data_bantuan_dana|
            data_bantuan_dana.update(status_pengajuan: Enums::StatusPengajuan::DONE)
          end
        end

      else
        penggalangan_dana_non_beasiswa.update({
          status_pengajuan: Enums::StatusPengajuan::DONE,
          status_penyaluran: Enums::StatusPenyaluran::PENDING
        })
---
SELECT `bantuandananonbeasiswa`.* FROM `bantuandananonbeasiswa` WHERE `bantuandananonbeasiswa`.`bantuan_dana_non_beasiswa_id` = 1 ORDER BY `bantuandananonbeasiswa`.`bantuan_dana_non_beasiswa_id` ASC LIMIT 1
SELECT `penggalangandanabeasiswa`.* FROM `penggalangandanabeasiswa`
UPDATE `bantuandananonbeasiswa` SET `bantuandananonbeasiswa`.`status_pengajuan` = 3 WHERE `bantuandananonbeasiswa`.`bantuan_dana_non_beasiswa_id` = 1