app/controllers/v1/pengajuan/pengajuan_bantuan_controller.rb

SELECT `civitasakademika`.* FROM `civitasakademika` WHERE `civitasakademika`.`nomor_induk` = '231511055' ORDER BY `civitasakademika`.`nomor_induk` ASC LIMIT 1
SELECT `bantuandanabeasiswa`.* FROM `bantuandanabeasiswa` WHERE `bantuandanabeasiswa`.`penggalangan_dana_beasiswa_id` = 1
SELECT `bantuandanabeasiswa`.* FROM `bantuandanabeasiswa` WHERE `bantuandanabeasiswa`.`penggalangan_dana_beasiswa_id` = 1 AND `bantuandanabeasiswa`.`mahasiswa_id` = '231511055' ORDER BY `bantuandanabeasiswa`.`bantuan_dana_beasiswa_id` ASC LIMIT 1
SELECT `mahasiswa`.* FROM `mahasiswa` WHERE `mahasiswa`.`nim` = '231511055' ORDER BY `mahasiswa`.`nim` ASC LIMIT 1
---
  def createPengajuanBeasiswa
    durasi_pengajuan, error_message, status_penggalangan_dana_beasiswa = getDurasiPengajuanBeasiswa(return_json: false)
    if status_penggalangan_dana_beasiswa != Enums::StatusPenggalanganDanaBeasiswa::SUBMITION_PERIOD
      return render_error_response("Pendaftaran Pengajuan Bantuan Dana Beasiswa belum dibuka!")
    end

    is_civitas = CivitasAkademika.where(nomor_induk: params[:nim]).first

    if !is_civitas.present?
      return render_error_response("NIM tidak dapat ditemukan!")
    end

    penggalangan_dana_beasiswa_on_going = PenggalanganDanaBeasiswa.on_going.first
    list_bantuan_dana_beasiswa_on_going = BantuanDanaBeasiswa.where(penggalangan_dana_beasiswa_id: penggalangan_dana_beasiswa_on_going.penggalangan_dana_beasiswa_id)
    if list_bantuan_dana_beasiswa_on_going.present?
      is_pengajuan = list_bantuan_dana_beasiswa_on_going.where(mahasiswa_id: params[:nim]).first
    end

    if is_pengajuan.present?
      return render_error_response("Pengajuan Bantuan Dana Beasiswa sudah dilakukan")
    end

    bantuan_dana_beasiswa = BantuanDanaBeasiswa.new(bantuan_dana_beasiswa_params)
    mahasiswa_registered = Mahasiswa.where(nim: params[:nim]).first

SELECT `rekeningbank`.* FROM `rekeningbank` WHERE `rekeningbank`.`nomor_rekening` = '13213213213' ORDER BY `rekeningbank`.`nomor_rekening` ASC LIMIT 1
---
      mahasiswa.assign_attributes(nama: is_civitas.nama)
    end

    rekening_bank_owned = RekeningBank.where(nomor_rekening: params[:nomor_rekening]).first

INSERT INTO `bantuandanabeasiswa` (`bantuan_dana_beasiswa_id`, `alasan_butuh_bantuan`, `golongan_ukt`, `kuitansi_pembayaran_ukt`, `gaji_orang_tua`, `bukti_slip_gaji_orang_tua`, `esai`, `jumlah_tanggungan_keluarga`, `biaya_transportasi`, `biaya_internet`, `biaya_kos`, `biaya_konsumsi`, `total_pengeluaran_keluarga`, `status_pengajuan`, `mahasiswa_id`, `penggalangan_dana_beasiswa_id`) VALUES (115095, 'Lagi butuh banget untuk semester depan', 4, 'C:\\fakepath\\231511055_2B-D3_Muhammad Raihan Pratama_Pretest2.pdf', 5000000, 'C:\\fakepath\\231511055_2B-D3_Muhammad Raihan Pratama_Pretest2.pdf', 'C:\\fakepath\\231511055_2B-D3_Muhammad Raihan Pratama_Pretest2.pdf', 2, '100000', '100000', '500000', '250000', 3000000, 0, '231511055', 1)
INSERT INTO `rekeningbank` (`nomor_rekening`, `nama_bank`, `nama_pemilik_rekening`, `mahasiswa_id`) VALUES ('13213213213', 'Mandiri', 'M RAIHAN PRATAMA', '231511055')
---
      mahasiswa: mahasiswa
    })

    if bantuan_dana_beasiswa.save && mahasiswa.save && rekening_bank.save

SELECT `bantuandanabeasiswa`.* FROM `bantuandanabeasiswa` WHERE `bantuandanabeasiswa`.`bantuan_dana_beasiswa_id` = 115095 ORDER BY `bantuandanabeasiswa`.`bantuan_dana_beasiswa_id` ASC LIMIT 1
---
  def createPenilaianEsai
    if params[:id].blank?
      return render_error_response("id tidak boleh kosong!")
    end

    bantuan_dana_beasiswa = BantuanDanaBeasiswa.where(bantuan_dana_beasiswa_id: params[:id]).first

UPDATE `bantuandanabeasiswa` SET `bantuandanabeasiswa`.`penilaian_esai` = 2 WHERE `bantuandanabeasiswa`.`bantuan_dana_beasiswa_id` = 115095
---
                     end
    bantuan_dana_beasiswa.assign_attributes({penilaian_esai: penilaian_esai})

    if bantuan_dana_beasiswa.save

SELECT `bantuandanabeasiswa`.* FROM `bantuandanabeasiswa` WHERE `bantuandanabeasiswa`.`bantuan_dana_beasiswa_id` = 115095 ORDER BY `bantuandanabeasiswa`.`bantuan_dana_beasiswa_id` ASC LIMIT 1
---
  def approvalPengajuanBeasiswa
    durasi_pengajuan, error_message, status_penggalangan_dana_beasiswa = getDurasiPengajuanBeasiswa(return_json: false)
    if status_penggalangan_dana_beasiswa != Enums::StatusPenggalanganDanaBeasiswa::APPROVAL_PERIOD
      return render_error_response("Pendaftaran Beasiswa masih dibuka!")
    end

    if params[:id].blank?
      return render_error_response("id tidak boleh kosong!")
    end

    bantuan_dana_beasiswa = BantuanDanaBeasiswa.where(bantuan_dana_beasiswa_id: params[:id]).first

UPDATE `bantuandanabeasiswa` SET `bantuandanabeasiswa`.`nominal_penyaluran` = '[0]', `bantuandanabeasiswa`.`status_pengajuan` = 1, `bantuandanabeasiswa`.`status_penyaluran` = '[0]' WHERE `bantuandanabeasiswa`.`bantuan_dana_beasiswa_id` = 115095
---
      nominal_penyaluran: [Constants::NOMINAL_PENYALURAN],
    })

    if bantuan_dana_beasiswa.save

SELECT `bantuandananonbeasiswa`.* FROM `bantuandananonbeasiswa` WHERE `bantuandananonbeasiswa`.`status_pengajuan` = 1
SELECT `penanggungjawabnonbeasiswa_has_penerimanonbeasiswa`.* FROM `penanggungjawabnonbeasiswa_has_penerimanonbeasiswa` WHERE `penanggungjawabnonbeasiswa_has_penerimanonbeasiswa`.`penanggung_jawab_non_beasiswa_id` = 'DSN002' ORDER BY `penanggungjawabnonbeasiswa_has_penerimanonbeasiswa`.`penanggung_jawab_non_beasiswa_id` ASC, `penanggungjawabnonbeasiswa_has_penerimanonbeasiswa`.`penerima_non_beasiswa_id` ASC LIMIT 1
---
  def getPengajuanNonBeasiswa(status_pengajuan)
    list_bantuan_dana_non_beasiswa = BantuanDanaNonBeasiswa.where(status_pengajuan: status_pengajuan)
    if !list_bantuan_dana_non_beasiswa.present?
      error_message = "Tidak ada data Pengajuan Bantuan Dana Non Beasiswa!"
    else
      array_of_pengajuan_non_beasiswa_baru = []
      list_bantuan_dana_non_beasiswa.each do |data|
        penanggung_jawab_penerima_non_beasiswa = PenanggungJawabNonBeasiswaHasPenerimaNonBeasiswa.where(penanggung_jawab_non_beasiswa_id: data.penanggung_jawab_non_beasiswa_id).first

UPDATE `bantuandanabeasiswa` SET `bantuandanabeasiswa`.`dokumen_kehadiran_perkuliahan` = 'C:\\fakepath\\231511055_2B-D3_Muhammad Raihan Pratama_Pretest2.pdf', `bantuandanabeasiswa`.`status_kehadiran_perkuliahan` = 0 WHERE `bantuandanabeasiswa`.`bantuan_dana_beasiswa_id` = 115095
---
  def createKehadiranPerkuliahan
    if params[:id].blank?
      return render_error_response("Id tidak boleh kosong!")
    end
    bantuan_dana_beasiswa = BantuanDanaBeasiswa.pengajuan_approved.where(bantuan_dana_beasiswa_id: params[:id]).first
    if !bantuan_dana_beasiswa.present?
      return render_error_response("Penerima Beasiswa tidak dapat ditemukan!")
    end
    if params[:dokumen_kehadiran_perkuliahan].blank?
      return render_error_response("Dokumen Kehadiran Perkuliahan tidak boleh kosong!")
    elsif params[:status_kehadiran_perkuliahan].blank?
      return render_error_response("Status Kehadiran Perkuliahan tidak boleh kosong!")
    end

    unless %w[TanpaSP SP1 SP2 SP3].include?(params[:status_kehadiran_perkuliahan])
      return render_error_response("is_approve hanya dapat TanpaSP atau SP1 atau SP2 atau SP3!")
    end
    bantuan_dana_beasiswa.update({
      dokumen_kehadiran_perkuliahan: params[:dokumen_kehadiran_perkuliahan],
      status_kehadiran_perkuliahan: params[:status_kehadiran_perkuliahan]
    })

SELECT `penggalangandanabeasiswa`.* FROM `penggalangandanabeasiswa` WHERE `penggalangandanabeasiswa`.`penggalangan_dana_beasiswa_id` = 1 LIMIT 1
---
  def selectLanjutBeasiswa
    if params[:id].blank?
      return render_error_response("Id tidak boleh kosong!")
    end
    bantuan_dana_beasiswa_existing = BantuanDanaBeasiswa.pengajuan_done.where(bantuan_dana_beasiswa_id: params[:id]).first
    if !bantuan_dana_beasiswa_existing.present?
      return render_error_response("Bantuan Dana Beasiswa tidak ditemukan atau belum selesai!")
    end

    if bantuan_dana_beasiswa_existing.dokumen_kehadiran_perkuliahan == nil
      return render_error_response("Dokumen Kehadiran Perkuliahan tidak ada!")
    end

    if bantuan_dana_beasiswa_existing.status_kehadiran_perkuliahan == nil
      return render_error_response("Status Kehadiran Perkuliahan tidak ada!")
    end

    if bantuan_dana_beasiswa_existing.penggalangan_dana_beasiswa.status != Enums::StatusPenggalanganDanaBeasiswa::DONE
      return render_error_response("Penggalangan Dana Beasiswa belum selesai!")
    end

    penggalangan_dana_beasiswa_existing = PenggalanganDanaBeasiswa.where("penggalangan_dana_beasiswa_id < ?", bantuan_dana_beasiswa_existing.penggalangan_dana_beasiswa).order("penggalangan_dana_beasiswa_id DESC").first

INSERT INTO `bantuandanabeasiswa` (`bantuan_dana_beasiswa_id`, `alasan_butuh_bantuan`, `golongan_ukt`, `kuitansi_pembayaran_ukt`, `gaji_orang_tua`, `bukti_slip_gaji_orang_tua`, `esai`, `jumlah_tanggungan_keluarga`, `biaya_transportasi`, `biaya_internet`, `biaya_kos`, `biaya_konsumsi`, `total_pengeluaran_keluarga`, `penilaian_esai`, `nominal_penyaluran`, `status_pengajuan`, `status_penyaluran`, `mahasiswa_id`, `penggalangan_dana_beasiswa_id`) VALUES (567364, 'Lagi butuh banget untuk semester depan', 4, 'C:\\fakepath\\231511055_2B-D3_Muhammad Raihan Pratama_Pretest2.pdf', 5000000, 'C:\\fakepath\\231511055_2B-D3_Muhammad Raihan Pratama_Pretest2.pdf', 'C:\\fakepath\\231511055_2B-D3_Muhammad Raihan Pratama_Pretest2.pdf', 2, '2', '100000', '500000', '250000', 3000000, 2, '[0]', 1, '[0]', '231511055', 0)
---
      mahasiswa: bantuan_dana_beasiswa_existing.mahasiswa,
    })

    if bantuan_dana_beasiswa_continue.save